<script>
  import Derived from './51_계산된_스토어/Derived.svelte'

  let toggle = true
</script>
<pre>
{'쓰기 가능(writable)하거나 읽기 전용(readable) 스토어를 통해 새롭게 계산한 값을 가지는 스토어를 생성합니다.\n' +
'\n' +
'유독 사용 패턴이 많지만 앞선 ‘쓰기 가능’, ‘읽기 전용’ 스토어 파트를 이해했다면 특별히 어려운 건 없습니다.\n' +
'\n' +
'첫 번째 인수는 계산에 사용할 스토어이고,\n' +
'계산할 스토어가 2개 이상인 경우 첫 번째 인수를 배열로 처리해야 합니다.\n' +
'\n' +
'두 번째 인수는 스토어 구독(자동, 수동)이 발생하면 실행될 콜백입니다.\n' +
'콜백에서 반환하는 함수는 구독이 모두 취소되면(구독자가 모두 없어지면) 실행됩니다.\n' +
'\n' +
'세 번째 인수는 계산이 완료되기 전에(비동기 요청 등) 최초 한 번 출력할 초깃값입니다.\n' +
'\n' +
'derived(스토어, 콜백)\n' +
'derived(스토어, 콜백, 초깃값)\n' +
'derived([스토어1, 스토어2], 콜백)\n' +
'derived([스토어1, 스토어2], 콜백, 초깃값)\n' +
'콜백에서 스토어를 사용해 계산할 수 있습니다.\n' +
'\n' +
'첫 번째 인수는 앞서 명시된 스토어의 값을 매개변수로 받습니다.\n' +
'앞서 명시된 스토어가 배열로 처리되었다면, 값도 순서대로 배열로 받아야 합니다.\n' +
'\n' +
'따로 기능이 있는 것은 아니고 통상적으로 매개변수 앞에 $를 붙여서 ‘스토어의 값’이라는 의미를 부여합니다.\n' +
'컴포넌트에서 사용하는 ‘스토어 자동 구독(Auto-subscription)’과는 관계가 없습니다.\n' +
'\n' +
'두 번째 인수는 set 매개변수입니다.\n' +
'콜백에서 ‘계산된 값’을 반환하면 스토어(derived)에 반영되는데,\n' +
'set 매겨변수가 명시되어 있으면, 반환되는 값은 ‘구독이 모두 취소되면 실행할 함수’가 됩니다.\n' +
'\n' +
'‘구독이 모두 취소되면 실행할 함수’가 필요하지 않은 일반적으로는 set 매개변수를 명시하지 마세요.\n' +
'\n' +
'다음 패턴에선 이해하기 쉽게 일반 함수을 사용했지만, 보통은 화살표 함수 사용을 권장합니다.\n\n' +
'' +
'function ($스토어) {\n' +
'  // 계산..\n' +
'  return 계산된_값\n' +
'}\n' +
'function ([$스토어1, $스토어2]) {\n' +
'  // 계산..\n' +
'  return 계산된_값\n' +
'}\n' +
'function ($스토어, set) {\n' +
'  // 계산..\n' +
'  set(계산된_값)\n' +
'  return 구독이_모두_취소되면_실행할_함수\n' +
'}'}
</pre>
<button on:click={() => toggle = !toggle}>
    Toggle
</button>

{#if toggle}
    <Derived />
{/if}
